STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_syscfg.c
## Configuration inside the SYSCFG driver

Config defines        | Description        | Default value | Note
----------------------| -------------------| ------------- | -----------------------------------------------------------
USE_HAL_SYSCFG_MODULE | from hal_conf.h    | 1U            | When set to 1, the HAL SYSCFG module is enabled.
USE_ASSERT_DBG_PARAM  | from IDE           | None          | When defined, enable the params assert.
  */

#if defined(USE_HAL_SYSCFG_MODULE) && (USE_HAL_SYSCFG_MODULE == 1)

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/* Exported variables ------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
/** @defgroup SYSCFG_Private_Constants SYSCFG Private Constants
  * @{
  */
#define SYSCFG_CCELL_MAX_DELAY_MS  50U   /*!< Max compensation cell timeout value (unit: milliseconds) */
#define HAL_SYSCFG_CCELL_SIZE      0x0FU /*!< Max size of compensation code                            */
/**
  * @}
  */

/* Private macro -----------------------------------------------------------------------------------------------------*/
/** @defgroup SYSCFG_Private_Macros SYSCFG Private Macros
  * @{
  */

/*! Decoupling capacitance check macro */
#define IS_SYSCFG_DECOUPLING_CAPACITANCE(capacitance)     \
  (((capacitance) == HAL_SYSCFG_CAPACITANCE_OFF)          \
   || ((capacitance) == HAL_SYSCFG_CAPACITANCE_1_DIV_3)   \
   || ((capacitance) == HAL_SYSCFG_CAPACITANCE_2_DIV_3)   \
   || ((capacitance) == HAL_SYSCFG_CAPACITANCE_FULL))

/*! Analog switch supply check macro */
#define IS_SYSCFG_ANALOG_SWITCH_SUPPLY(analog_switch) \
  (((analog_switch) == HAL_SYSCFG_VDDA_SUPPLY)        \
   || ((analog_switch) == HAL_SYSCFG_BOOSTER_SUPPLY)  \
   || ((analog_switch) == HAL_SYSCFG_VDD_SUPPLY))

/*! Fast mode plus check macro */
#define IS_SYSCFG_FAST_MODE_PLUS(fast_mode_plus)           \
  ((((fast_mode_plus) & (HAL_SYSCFG_DRIVE_ALL)) != 0U)     \
   && (((fast_mode_plus) & (~HAL_SYSCFG_DRIVE_ALL)) == 0U))

/*! Get fast mode plus check macro */
#define IS_SYSCFG_GET_FAST_MODE_PLUS(fast_mode_plus) \
  (((fast_mode_plus) == (HAL_SYSCFG_DRIVE_PB6))      \
   || ((fast_mode_plus) == (HAL_SYSCFG_DRIVE_PB7))   \
   || ((fast_mode_plus) == (HAL_SYSCFG_DRIVE_PB8))   \
   || ((fast_mode_plus) == (HAL_SYSCFG_DRIVE_PB9)))

/*! Set floating point unit interrupts check macro */
#define IS_SYSCFG_SET_FLOATING_POINT_IT(floating_point)     \
  ((((floating_point) & (HAL_SYSCFG_IT_FPU_ALL)) != 0U)     \
   && (((floating_point) & (~HAL_SYSCFG_IT_FPU_ALL)) == 0U))

/*! Get floating point unit interrupts check macro */
#define IS_SYSCFG_GET_FLOATING_POINT_IT(floating_point) \
  (((floating_point) == (HAL_SYSCFG_IT_FPU_IOC))        \
   || ((floating_point) == (HAL_SYSCFG_IT_FPU_DZC))     \
   || ((floating_point) == (HAL_SYSCFG_IT_FPU_UFC))     \
   || ((floating_point) == (HAL_SYSCFG_IT_FPU_OFC))     \
   || ((floating_point) == (HAL_SYSCFG_IT_FPU_IDC))     \
   || ((floating_point) == (HAL_SYSCFG_IT_FPU_IXC)))

/*! TIM break inputs check macro */
#define IS_SYSCFG_TIM_BREAK_INPUTS(break_input)                   \
  ((((break_input) & HAL_SYSCFG_TIM_BREAK_INPUTS_ALL) != 0U)      \
   && (((break_input) & (~HAL_SYSCFG_TIM_BREAK_INPUTS_ALL)) == 0U))

/*! Get TIM break inputs check macro */
#define IS_SYSCFG_GET_TIM_BREAK_INPUTS(break_input)       \
  (((break_input) == HAL_SYSCFG_FLASH_ECC_DOUBLE_ERROR)   \
   || ((break_input) == HAL_SYSCFG_PVD)                   \
   || ((break_input) == HAL_SYSCFG_SRAM_ECC_DOUBLE_ERROR) \
   || ((break_input) == HAL_SYSCFG_LOCKUP_OUT))

/*! Compensation cell check macro */
#define IS_SYSCFG_CCELL(comp_cell)                    \
  ((((comp_cell) & HAL_SYSCFG_CCELL_ALL) != 0U)       \
   && (((comp_cell) & (~HAL_SYSCFG_CCELL_ALL)) == 0U))

/*! Compensation code check macro */
#define IS_SYSCFG_CCELL_CODE(code_select)             \
  (((code_select) == HAL_SYSCFG_CCELL_CODE_DEFAULT)   \
   || ((code_select) == HAL_SYSCFG_CCELL_CODE_CUSTOM))

/*! Get compensation cell check macro */
#if defined(SYSCFG_CCCSR_EN3)
#define IS_SYSCFG_GET_CCELL(comp_cell)             \
  (((comp_cell) == HAL_SYSCFG_CCELL_VDDIO)         \
   || ((comp_cell) == HAL_SYSCFG_CCELL_VDDIO2)     \
   || ((comp_cell) == HAL_SYSCFG_CCELL_HSPIIO))
#else
#define IS_SYSCFG_GET_CCELL(comp_cell)             \
  (((comp_cell) == HAL_SYSCFG_CCELL_VDDIO)         \
   || ((comp_cell) == HAL_SYSCFG_CCELL_VDDIO2))
#endif /* SYSCFG_CCCSR_EN3 */

/*! XMOS compensation cell check macro */
#define IS_SYSCFG_XMOS_CCELL_CODE(pmos_code,nmos_code) \
  (((pmos_code) <= HAL_SYSCFG_CCELL_SIZE)              \
   && ((nmos_code) <= HAL_SYSCFG_CCELL_SIZE))

#if defined(SYSCFG_OTGHSPHYCR_EN)
/*! USB HS PHY reference clock frequency check macro */
#define IS_SYSCFG_USBHSPHY_FREQUENCY(clk_frequency) \
  (((clk_frequency) == HAL_SYSCFG_USBHSPHY_16MHZ)         \
   ||((clk_frequency) == HAL_SYSCFG_USBHSPHY_19_2MHZ)     \
   ||((clk_frequency) == HAL_SYSCFG_USBHSPHY_20MHZ)       \
   ||((clk_frequency) == HAL_SYSCFG_USBHSPHY_24MHZ)       \
   ||((clk_frequency) == HAL_SYSCFG_USBHSPHY_26MHZ)       \
   ||((clk_frequency) == HAL_SYSCFG_USBHSPHY_32MHZ))

/*! USB HS PHY squelch threshold adjustment check macro */
#define IS_SYSCFG_USBHSPHY_SQUELCH(squelch_threshold)                    \
  (((squelch_threshold) == HAL_SYSCFG_SQUELCH_ADJUST_0_PERCENT)          \
   || ((squelch_threshold) == HAL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT))

/*! USB HS PHY transmitter preemphasis current check macro */
#define IS_SYSCFG_USBHSPHY_SRC_CURRENT(src_current) \
  (((src_current) == HAL_SYSCFG_SRC_CURRENT_NO)     \
   ||((src_current) == HAL_SYSCFG_SRC_CURRENT_1 )   \
   ||((src_current) == HAL_SYSCFG_SRC_CURRENT_2 )   \
   ||((src_current) == HAL_SYSCFG_SRC_CURRENT_3 ))

/*! USB HS PHY Disconnect threshold adjustment check macro */
#define IS_SYSCFG_USBHSPHY_DISCONNECT(disconnect_threshold)              \
  (((disconnect_threshold) == HAL_SYSCFG_DIS_ADJUST_0_PERCENT)           \
   || ((disconnect_threshold) == HAL_SYSCFG_DIS_ADJUST_PLUS_5_9_PERCENT))
#endif /* SYSCFG_OTGHSPHYCR_EN */
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup SYSCFG_Exported_Functions
  * @{
  */

/** @addtogroup SYSCFG_Exported_Functions_Group1
  * @{
  This section provides functions allowing to global functions :
  - Call HAL_SYSCFG_SetAnalogIOSwitchSupply() function to set the I/O analog switches supply.
  - Call HAL_SYSCFG_GetAnalogIOSwitchSupply() function to get the I/O analog switches supply.
  - Call HAL_SYSCFG_EnableFastModePlus() function to enable the fast mode plus capability.
  - Call HAL_SYSCFG_DisableFastModePlus() function to disable the fast mode plus capability.
  - Call HAL_SYSCFG_IsEnabledFastModePlus() function to check that fast mode plus capability is enabled.
  - Call HAL_SYSCFG_SetHSPISupplyDecouplingCapacitance() function to set the decoupling capacitance on HSPI supply.
  - Call HAL_SYSCFG_GetHSPISupplyDecouplingCapacitance() function to get the decoupling capacitance on HSPI supply.
  - Call HAL_SYSCFG_EnableDCACHE2SRAMCacheability() function to enable the Cacheability of internal SRAMx by DCACHE2.
  - Call HAL_SYSCFG_DisableDCACHE2SRAMCacheability() function to disable the Cacheability of internal SRAMx by DCACHE2.
  - Call HAL_SYSCFG_IsEnabledDCACHE2SRAMCacheability() function to check if the Cacheability of internal SRAMx
    by DCACHE2 is enabled or disabled.
  */

/**
  * @brief  Set the I/O analog switch supply.
  * @param  analog_switch This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_VDDA_SUPPLY
  *         @arg @ref HAL_SYSCFG_BOOSTER_SUPPLY
  *         @arg @ref HAL_SYSCFG_VDD_SUPPLY
  */
void HAL_SYSCFG_SetAnalogIOSwitchSupply(hal_syscfg_analog_switch_t analog_switch)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_ANALOG_SWITCH_SUPPLY(analog_switch));

  LL_SYSCFG_SetAnalogIOSwitchSupply((uint32_t)analog_switch);
}

/**
  * @brief  Get the I/O analog switch supply.
  * @retval hal_syscfg_analog_switch_t I/O Analog switch supply.
  */
hal_syscfg_analog_switch_t HAL_SYSCFG_GetAnalogIOSwitchSupply(void)
{
  return (hal_syscfg_analog_switch_t) LL_SYSCFG_GetAnalogIOSwitchSupply();
}

/**
  * @brief  Enable the fast mode plus driving capability.
  * @param  fast_mode_plus This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_DRIVE_PB6
  *         @arg @ref HAL_SYSCFG_DRIVE_PB7
  *         @arg @ref HAL_SYSCFG_DRIVE_PB8
  *         @arg @ref HAL_SYSCFG_DRIVE_PB9
  */
void HAL_SYSCFG_EnableFastModePlus(uint32_t fast_mode_plus)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_FAST_MODE_PLUS(fast_mode_plus));

  LL_SYSCFG_EnableFastModePlus(fast_mode_plus);
}

/**
  * @brief  Disable the fast mode plus driving capability.
  * @param  fast_mode_plus This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_DRIVE_PB6
  *         @arg @ref HAL_SYSCFG_DRIVE_PB7
  *         @arg @ref HAL_SYSCFG_DRIVE_PB8
  *         @arg @ref HAL_SYSCFG_DRIVE_PB9
  */
void HAL_SYSCFG_DisableFastModePlus(uint32_t fast_mode_plus)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_FAST_MODE_PLUS(fast_mode_plus));

  LL_SYSCFG_DisableFastModePlus(fast_mode_plus);
}

/**
  * @brief  Check that fast mode plus driving capability is enabled.
  * @param  fast_mode_plus This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_DRIVE_PB6
  *         @arg @ref HAL_SYSCFG_DRIVE_PB7
  *         @arg @ref HAL_SYSCFG_DRIVE_PB8
  *         @arg @ref HAL_SYSCFG_DRIVE_PB9
  * @retval hal_syscfg_fast_mode_plus_status_t Fast mode plus status
  */
hal_syscfg_fast_mode_plus_status_t HAL_SYSCFG_IsEnabledFastModePlus(uint32_t fast_mode_plus)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_FAST_MODE_PLUS(fast_mode_plus));

  return (hal_syscfg_fast_mode_plus_status_t)LL_SYSCFG_IsEnabledFastModePlus(fast_mode_plus);
}

#if defined(SYSCFG_CFGR1_ENDCAP)
/**
  * @brief  Set the decoupling capacitance on HSPI supply.
  * @param  capacitance This parameter is an element of \ref hal_syscfg_capacitance_t enumeration.
  */
void HAL_SYSCFG_SetHSPISupplyDecouplingCapacitance(hal_syscfg_capacitance_t capacitance)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_DECOUPLING_CAPACITANCE(capacitance));

  LL_SYSCFG_SetHSPISupplyDecouplingCapacitance((uint32_t) capacitance);
}

/**
  * @brief  Get the decoupling capacitance on HSPI supply.
  * @retval hal_syscfg_capacitance_t Decoupling capacitance value.
  */
hal_syscfg_capacitance_t HAL_SYSCFG_GetHSPISupplyDecouplingCapacitance(void)
{
  return ((hal_syscfg_capacitance_t)LL_SYSCFG_GetHSPISupplyDecouplingCapacitance());
}
#endif /* SYSCFG_CFGR1_ENDCAP */

