STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_syscfg.c
#if defined(SYSCFG_CFGR1_SRAMCACHED)
/**
  * @brief  Enable the cacheability of internal SRAMx by DCACHE2.
  */
void HAL_SYSCFG_EnableDCACHE2SRAMCacheability(void)
{
  LL_SYSCFG_EnableDCACHE2SRAMCacheability();
}

/**
  * @brief  Disable the cacheability of internal SRAMx by DCACHE2.
  */
void HAL_SYSCFG_DisableDCACHE2SRAMCacheability(void)
{
  LL_SYSCFG_DisableDCACHE2SRAMCacheability();
}

/**
  * @brief  Check that cacheability of internal SRAMx by DCACHE2 is enabled.
  * @retval hal_syscfg_dcache2_sram_status_t DCACHE2 SRAM capability status.
  */
hal_syscfg_dcache2_sram_status_t HAL_SYSCFG_IsEnabledDCACHE2SRAMCacheability(void)
{
  return (hal_syscfg_dcache2_sram_status_t)LL_SYSCFG_IsEnabledDCACHE2SRAMCacheability();
}
#endif /* SYSCFG_CFGR1_SRAMCACHED */
/**
  * @}
  */

/** @addtogroup SYSCFG_Exported_Functions_Group2
  * @{
  This section provides functions allowing to manage the floating point interrupts:
  - Call HAL_SYSCFG_EnableFPUIT() to enable floating point unit interrupts.
  - Call HAL_SYSCFG_DisableFPUIT() to disable floating point unit Interrupts.
  - Call HAL_SYSCFG_IsEnabledFPUIT() to check that floating point unit Interrupts is enabled.
  */

/**
  * @brief  Enable the floating point unit interrupts.
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_IT_FPU_IOC
  *         @arg @ref HAL_SYSCFG_IT_FPU_DZC
  *         @arg @ref HAL_SYSCFG_IT_FPU_UFC
  *         @arg @ref HAL_SYSCFG_IT_FPU_OFC
  *         @arg @ref HAL_SYSCFG_IT_FPU_IDC
  *         @arg @ref HAL_SYSCFG_IT_FPU_IXC
  *         @arg @ref HAL_SYSCFG_IT_FPU_ALL
  */
void HAL_SYSCFG_EnableFPUIT(uint32_t floating_point)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_SET_FLOATING_POINT_IT(floating_point));

  LL_SYSCFG_EnableFPUIT(floating_point);
}

/**
  * @brief  Disable the floating point unit interrupts.
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_IT_FPU_IOC
  *         @arg @ref HAL_SYSCFG_IT_FPU_DZC
  *         @arg @ref HAL_SYSCFG_IT_FPU_UFC
  *         @arg @ref HAL_SYSCFG_IT_FPU_OFC
  *         @arg @ref HAL_SYSCFG_IT_FPU_IDC
  *         @arg @ref HAL_SYSCFG_IT_FPU_IXC
  *         @arg @ref HAL_SYSCFG_IT_FPU_ALL
  */
void HAL_SYSCFG_DisableFPUIT(uint32_t floating_point)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_SET_FLOATING_POINT_IT(floating_point));

  LL_SYSCFG_DisableFPUIT(floating_point);
}

/**
  * @brief  Check that floating point unit interrupts is enabled.
  * @param  floating_point This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_IT_FPU_IOC
  *         @arg @ref HAL_SYSCFG_IT_FPU_DZC
  *         @arg @ref HAL_SYSCFG_IT_FPU_UFC
  *         @arg @ref HAL_SYSCFG_IT_FPU_OFC
  *         @arg @ref HAL_SYSCFG_IT_FPU_IDC
  *         @arg @ref HAL_SYSCFG_IT_FPU_IXC
  * @retval hal_syscfg_it_fpu_status_t Floating point interrupt status.
  */
hal_syscfg_it_fpu_status_t HAL_SYSCFG_IsEnabledFPUIT(uint32_t floating_point)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_FLOATING_POINT_IT(floating_point));

  return (hal_syscfg_it_fpu_status_t)LL_SYSCFG_IsenabledFPUIT(floating_point);
}
/**
  * @}
  */

/** @addtogroup SYSCFG_Exported_Functions_Group3
  * @{
  This section provides functions allowing to manage the TIM break inputs:
  - Call HAL_SYSCFG_EnableTIMBreakInputs() to enable the TIM break inputs.
  - Call HAL_SYSCFG_IsEnabledTIMBreakInputs() to check that the TIM break inputs is enabled.
  - \b Note: The TIM break inputs deactivation can only be done by a hardware reset.
  */
/**
  * @brief  Enable the TIM break inputs.
  * @param  break_input This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref HAL_SYSCFG_PVD
  *         @arg @ref HAL_SYSCFG_SRAM_ECC_DOUBLE_ERROR
  *         @arg @ref HAL_SYSCFG_LOCKUP_OUT
  * @note   The TIM break input deactivation can only be done by a hardware reset.
  */
void HAL_SYSCFG_EnableTIMBreakInputs(uint32_t break_input)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_TIM_BREAK_INPUTS(break_input));

  LL_SYSCFG_EnableTIMBreakInputs(break_input);
}

/**
  * @brief  Check that TIM break inputs is enabled.
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref HAL_SYSCFG_PVD
  *         @arg @ref HAL_SYSCFG_SRAM_ECC_DOUBLE_ERROR
  *         @arg @ref HAL_SYSCFG_LOCKUP_OUT
  * @retval hal_syscfg_tim_break_input_status_t TIM break inputs status.
  */
hal_syscfg_tim_break_input_status_t HAL_SYSCFG_IsEnabledTIMBreakInputs(uint32_t break_input)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_TIM_BREAK_INPUTS(break_input));

  return (hal_syscfg_tim_break_input_status_t)LL_SYSCFG_IsEnabledTIMBreakInputs(break_input);
}
/**
  * @}
  */

/** @addtogroup SYSCFG_Exported_Functions_Group4
  * @{
  This section provides functions allowing to control the compensation cell:
  - Call HAL_SYSCFG_SetConfigCompensationCellCode() to configure the code selection for each compensation cell.
  - Call HAL_SYSCFG_GetConfigCompensationCellCode() to get the compensation cell code.
  - Call HAL_SYSCFG_EnableCompensationCell() to enable the I/O compensation cell.
  - Call HAL_SYSCFG_DisableCompensationCell() to disable the I/O compensation cell.
  - Call HAL_SYSCFG_IsEnabledCompensationCell() to check that I/O compensation cell is enabled.
  */

/**
  * @brief  Configure the compensation cell code.
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *         @arg @ref HAL_SYSCFG_CCELL_ALL
  * @param  code_select This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_CODE_DEFAULT
  *         @arg @ref HAL_SYSCFG_CCELL_CODE_CUSTOM
  * @note   (*) value not defined in all devices
  */
void HAL_SYSCFG_SetConfigCompensationCellCode(uint32_t comp_cell, hal_syscfg_ccell_code_t code_select)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_CCELL_CODE(code_select));
  ASSERT_DBG_PARAM(IS_SYSCFG_CCELL(comp_cell));

  LL_SYSCFG_SetConfigCompensationCellCodeSource(comp_cell, (uint32_t)code_select);
}

/**
  * @brief  Get the compensation cell code.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @retval hal_syscfg_ccell_code_t Compensation cell code.
  */
hal_syscfg_ccell_code_t HAL_SYSCFG_GetConfigCompensationCellCode(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_CCELL(comp_cell));

  return (hal_syscfg_ccell_code_t)LL_SYSCFG_GetConfigCompensationCellCodeSource(comp_cell);
}

/**
  * @brief   Enable the I/O compensation cell.
  * @param   comp_cell This parameter can be one or a combination of the following values:
  *          @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *          @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *          @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *          @arg @ref HAL_SYSCFG_CCELL_ALL
  * @note    (*) value not defined in all devices
  * @warning Before enabling the VDDIO2 compensation cell, it is mandatory to ensure that the independent IO2 supply
  *          is enabled through the use of the HAL_PWR_EnableIndependentVddIO2Supply() function
  * @retval  hal_status_t Compensation cell status.
  */
hal_status_t HAL_SYSCFG_EnableCompensationCell(uint32_t comp_cell)
{
  uint32_t timeout = (SYSCFG_CCELL_MAX_DELAY_MS * (SystemCoreClock / 1000U)) + 1U;
  uint32_t comp_rdy1;
  uint32_t comp_rdy2;

