STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_syscfg.c
#if defined(SYSCFG_CCCSR_EN3)
  uint32_t comp_rdy3;
#endif /* SYSCFG_CCCSR_EN3 */

  uint32_t comp_rdy;

  ASSERT_DBG_PARAM(IS_SYSCFG_CCELL(comp_cell));

  LL_SYSCFG_EnableCompensationCell(comp_cell);

  do
  {
    comp_rdy1 = LL_SYSCFG_IsActiveFlag_RDY1() << SYSCFG_CCCSR_EN1_Pos;
    comp_rdy2 = LL_SYSCFG_IsActiveFlag_RDY2() << SYSCFG_CCCSR_EN2_Pos;

#if defined(SYSCFG_CCCSR_EN3)
    comp_rdy3 = LL_SYSCFG_IsActiveFlag_RDY3() << SYSCFG_CCCSR_EN3_Pos;
#endif /* SYSCFG_CCCSR_EN3 */

#if defined(SYSCFG_CCCSR_EN3)
    comp_rdy = (comp_rdy1 | comp_rdy2 | comp_rdy3);
#else
    comp_rdy = (comp_rdy1 | comp_rdy2);
#endif /* SYSCFG_CCCSR_EN3 */

    timeout--;

  } while (((comp_rdy & comp_cell) != comp_cell) && (timeout != 0U));

  if (timeout == 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Disable the I/O compensation cell.
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *         @arg @ref HAL_SYSCFG_CCELL_ALL
  * @note   (*) value not defined in all devices
  */
void HAL_SYSCFG_DisableCompensationCell(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_CCELL(comp_cell));

  LL_SYSCFG_DisableCompensationCell(comp_cell);
}

/**
  * @brief  Check that I/O compensation cell is enabled.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @retval hal_syscfg_ccell_status_t I/O Compensation cell status.
  */
hal_syscfg_ccell_status_t HAL_SYSCFG_IsEnabledCompensationCell(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_CCELL(comp_cell));

  return ((hal_syscfg_ccell_status_t)LL_SYSCFG_IsEnabledCompensationCell(comp_cell));
}
/**
  * @}
  */

/** @addtogroup SYSCFG_Exported_Functions_Group5
  * @{
  This section provides functions allowing to manage backup domain write protection:
  - Call HAL_SYSCFG_GetPMOSCompensationCellValue() to get the PMOS compensation value of selected compensation cell.
  - Call HAL_SYSCFG_GetNMOSCompensationCellValue() to get the NMOS compensation value of selected compensation cell.
  - Call HAL_SYSCFG_SetxMOSCompensationCellCode() to set the compensation cell code.
  - Call HAL_SYSCFG_GetxMOSCompensationCellCode() to get the compensation cell code.
  */

/**
  * @brief  Get the PMOS compensation value.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @retval Returned value of the PMOS compensation cell
  */
uint32_t HAL_SYSCFG_GetPMOSCompensationCellValue(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_CCELL(comp_cell));

  return (LL_SYSCFG_GetPMOSCompensationCellValue(comp_cell));
}

/**
  * @brief  Get the NMOS compensation value of selected compensation cell.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @retval uint32_t Value of the NMOS compensation cell
  */
uint32_t HAL_SYSCFG_GetNMOSCompensationCellValue(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_CCELL(comp_cell));

  return (LL_SYSCFG_GetNMOSCompensationCellValue(comp_cell));
}

/**
  * @brief  Set the compensation cell code.
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *         @arg @ref HAL_SYSCFG_CCELL_ALL
  * @param  pmos_code Applied PMOS value of compensation cell
  * @param  nmos_code Applied NMOS value of compensation cell
  * @note   (*) value not defined in all devices
  */
void HAL_SYSCFG_SetxMOSCompensationCellCode(uint32_t comp_cell, uint32_t pmos_code, uint32_t nmos_code)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_CCELL(comp_cell));
  ASSERT_DBG_PARAM(IS_SYSCFG_XMOS_CCELL_CODE(pmos_code, nmos_code));

  if ((comp_cell & HAL_SYSCFG_CCELL_VDDIO) != 0U)
  {
    LL_SYSCFG_SetxMOSVddIOCompensationCellCode(pmos_code, nmos_code);
  }

  if ((comp_cell & HAL_SYSCFG_CCELL_VDDIO2) != 0U)
  {
    LL_SYSCFG_SetxMOSVddIO2CompensationCellCode(pmos_code, nmos_code);
  }

#if defined(SYSCFG_CCCSR_EN3)
  if ((comp_cell & HAL_SYSCFG_CCELL_HSPIIO) != 0U)
  {
    LL_SYSCFG_SetxMOSVddHSPIIOCompensationCellCode(pmos_code, nmos_code);
  }
#endif /* SYSCFG_CCCSR_EN3 */

}

/**
  * @brief  Get the compensation cell code.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO
  *         @arg @ref HAL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref HAL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @param  p_pmos_code Pointer to PMOS register of selected compensation cell
  * @param  p_nmos_code Pointer to NMOS register of selected compensation cell
  * @note   (*) value not defined in all devices
  */
void HAL_SYSCFG_GetxMOSCompensationCellCode(uint32_t comp_cell, uint32_t *p_pmos_code, uint32_t *p_nmos_code)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_GET_CCELL(comp_cell));

  *p_pmos_code = (LL_SYSCFG_GetPMOSCompensationCellCode(comp_cell) >> (POSITION_VAL(comp_cell << 1U) * 4U));
  *p_nmos_code = (LL_SYSCFG_GetNMOSCompensationCellCode(comp_cell) >> (POSITION_VAL(comp_cell) * 4U));
}
/**
  * @}
  */

#if defined(SYSCFG_OTGHSPHYCR_EN)
/** @addtogroup SYSCFG_Exported_Functions_Group6
  * @{
  This section provides functions allowing to manage the USB HS PHY:
  - Call HAL_SYSCFG_EnableUSBHSPHY() to enable the USB HS PHY.
  - Call HAL_SYSCFG_DisableUSBHSPHY() to disable the USB HS PHY.
  - Call HAL_SYSCFG_IsEnabledUSBHSPHY() to check that USB HS PHY is enabled.
  - Call HAL_SYSCFG_EnableUSBHSPHYPowerDown() to enable the USB HS PHY power down control.
  - Call HAL_SYSCFG_DisableUSBHSPHYPowerDown() to disable the USB HS PHY power down control.
  - Call HAL_SYSCFG_IsEnabledUSBHSPHYPowerDown() to check that USB HS PHY power down is enabled.
  - Call HAL_SYSCFG_SetUSBHSPHYReferenceClockFrequency() to set the USB HS PHY reference clock frequency selection.
  - Call HAL_SYSCFG_GetUSBHSPHYReferenceClockFrequency() to get the USB HS PHY reference clock frequency selection.
  */

/**
  * @brief  Enable the USB HS PHY feature.
  */
void HAL_SYSCFG_EnableUSBHSPHY(void)
{
  LL_SYSCFG_EnableUSBHSPHY();
}

/**
  * @brief  Disable the USB HS PHY feature.
  */
void HAL_SYSCFG_DisableUSBHSPHY(void)
{
  LL_SYSCFG_DisableUSBHSPHY();
}

/**
  * @brief  Check that USB HS PHY is enabled.
  * @retval hal_syscfg_usbhsphy_status_t USB HS PHY status.
  */
hal_syscfg_usbhsphy_status_t HAL_SYSCFG_IsEnabledUSBHSPHY(void)
{
  return (hal_syscfg_usbhsphy_status_t) LL_SYSCFG_IsEnabledUSBHSPHY();
}

/**
  * @brief  Enable the USB HS PHY  Power Down control.
  */
void HAL_SYSCFG_EnableUSBHSPHYPowerDown(void)
{
  LL_SYSCFG_EnableUSBHSPHYPowerDown();
}

/**
  * @brief  Disable the USB HS PHY  Power Down control.
  */
void HAL_SYSCFG_DisableUSBHSPHYPowerDown(void)
{
  LL_SYSCFG_DisableUSBHSPHYPowerDown();
}

/**
  * @brief  Check that USB HS PHY power down control is enabled.
  * @retval hal_syscfg_usbhsphy_power_down_status_t USB HS PHY power down control status.
  */
hal_syscfg_usbhsphy_power_down_status_t  HAL_SYSCFG_IsEnabledUSBHSPHYPowerDown(void)
{
  return (hal_syscfg_usbhsphy_power_down_status_t) LL_SYSCFG_IsEnabledUSBHSPHYPowerDown();
}

/**
  * @brief  Set the USB HS  PHY reference clock frequency selection.
  * @param  clk_frequency This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_USBHSPHY_16MHZ
  *         @arg @ref HAL_SYSCFG_USBHSPHY_19_2MHZ
  *         @arg @ref HAL_SYSCFG_USBHSPHY_20MHZ
  *         @arg @ref HAL_SYSCFG_USBHSPHY_24MHZ
  *         @arg @ref HAL_SYSCFG_USBHSPHY_26MHZ
  *         @arg @ref HAL_SYSCFG_USBHSPHY_32MHZ
  */
void HAL_SYSCFG_SetUSBHSPHYReferenceClockFrequency(hal_syscfg_usbhsphy_frequency_t clk_frequency)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_FREQUENCY(clk_frequency));

  LL_SYSCFG_SetUSBHSPHYReferenceClockFrequency((uint32_t)clk_frequency);
}

/**
  * @brief  Get the USB PHY reference clock frequency selection.
  * @retval hal_syscfg_usbhsphy_frequency_t Reference clock frequency.
  */
hal_syscfg_usbhsphy_frequency_t HAL_SYSCFG_GetUSBHSPHYReferenceClockFrequency(void)
{
  return ((hal_syscfg_usbhsphy_frequency_t)LL_SYSCFG_GetUSBHSPHYReferenceClockFrequency());
}
/**
  * @}
  */
#endif /* SYSCFG_OTGHSPHYCR_EN */

