STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_syscfg.c
#if defined(SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE)
/** @addtogroup SYSCFG_Exported_Functions_Group7
  * @{
  This section provides functions allowing to manage backup domain write protection:
  - Call HAL_SYSCFG_SetConfigUSBHSPHY() to set all the USB HS PHY tune simultaneously.
  - Call HAL_SYSCFG_GetConfigUSBHSPHY() to get all the USB HS PHY tune simultaneously.
  - Call HAL_SYSCFG_SetUSBHSPHYDisconnectThresholdAdjustment() to set the USB HS PHY Disconnect Threshold adjustment.
  - Call HAL_SYSCFG_GetUSBHSPHYDisconnectThresholdAdjustment() to get the USB HS PHY Disconnect Threshold adjustment.
  - Call HAL_SYSCFG_SetUSBHSPHYSquelchThresholdAdjustment() to set the USB HS PHY squelch threshold adjustment.
  - Call HAL_SYSCFG_GetUSBHSPHYSquelchThresholdAdjustment() to get the USB HS PHY squelch threshold adjustment.
  - Call HAL_SYSCFG_SetUSBHSPHYTransmitterPreemphasisCurrent() to set the USB HS HS PHY transmitter preemphasis current.
  - Call HAL_SYSCFG_GetUSBHSPHYTransmitterPreemphasisCurrent() to get the USB HS HS PHY transmitter preemphasis current.
  */

/**
  * @brief  Set all USB HS PHY tune simultaneously.
  * @param  disconnect_threshold This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_DIS_ADJUST_0_PERCENT
  *         @arg @ref HAL_SYSCFG_DIS_ADJUST_PLUS_5_9_PERCENT
  * @param  squelch_threshold This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_SQUELCH_ADJUST_0_PERCENT
  *         @arg @ref HAL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT
  * @param  src_current This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_NO
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_1
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_2
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_3
  */
void HAL_SYSCFG_SetConfigUSBHSPHY(hal_syscfg_disconnect_adjustment_t disconnect_threshold,
                                  hal_syscfg_squelch_adjust_t squelch_threshold, hal_syscfg_src_current_t src_current)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_DISCONNECT(disconnect_threshold));
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_SQUELCH(squelch_threshold));
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_SRC_CURRENT(src_current));

  LL_SYSCFG_SetConfigUSBHSPHY((uint32_t)disconnect_threshold, (uint32_t)squelch_threshold,
                              (uint32_t)src_current);
}

/**
  * @brief  Get the USB HS PHY tune.
  * @param  p_disconnect_threshold This parameter is a pointer of \ref hal_syscfg_disconnect_adjustment_t enumeration.
  * @param  p_squelch_threshold    This parameter is a pointer of \ref hal_syscfg_squelch_adjust_t enumeration.
  * @param  p_src_current          This parameter is a pointer of \ref hal_syscfg_src_current_t enumeration.
  */
void HAL_SYSCFG_GetConfigUSBHSPHY(hal_syscfg_disconnect_adjustment_t *p_disconnect_threshold,
                                  hal_syscfg_squelch_adjust_t *p_squelch_threshold,
                                  hal_syscfg_src_current_t *p_src_current)
{
  uint32_t reg_value = (LL_SYSCFG_READ_REG(OTGHSPHYTUNER2) &                              \
                        (SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE | SYSCFG_OTGHSPHYTUNER2_SQRXTUNE | \
                         SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE));

  *p_disconnect_threshold = (hal_syscfg_disconnect_adjustment_t)(uint32_t)(reg_value &
                                                                           SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE);
  *p_squelch_threshold    = (hal_syscfg_squelch_adjust_t)(uint32_t)(reg_value & SYSCFG_OTGHSPHYTUNER2_SQRXTUNE);
  *p_src_current          = (hal_syscfg_src_current_t)(uint32_t)(reg_value & SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE);
}

/**
  * @brief  Set the USB HS PHY disconnect threshold adjustment.
  * @param  disconnect_threshold This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_DIS_ADJUST_0_PERCENT
  *         @arg @ref HAL_SYSCFG_DIS_ADJUST_PLUS_5_9_PERCENT
  */
void HAL_SYSCFG_SetUSBHSPHYDisconnectThresholdAdjustment(hal_syscfg_disconnect_adjustment_t disconnect_threshold)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_DISCONNECT(disconnect_threshold));

  LL_SYSCFG_SetUSBHSPHYDisconnectThresholdAdjustment((uint32_t)disconnect_threshold);
}

/**
  * @brief  Get the USB HS PHY disconnect Threshold adjustment.
  * @retval hal_syscfg_disconnect_adjustment_t Disconnect threshold adjustment value.
  */
hal_syscfg_disconnect_adjustment_t HAL_SYSCFG_GetUSBHSPHYDisconnectThresholdAdjustment(void)
{
  return ((hal_syscfg_disconnect_adjustment_t)LL_SYSCFG_GetUSBHSPHYDisconnectThresholdAdjustment());
}


/**
  * @brief  Adjust the voltage level for the threshold used to detect valid high speed data.
  * @param  squelch_threshold This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_SQUELCH_ADJUST_0_PERCENT
  *         @arg @ref HAL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT
  */
void HAL_SYSCFG_SetUSBHSPHYSquelchThresholdAdjustment(hal_syscfg_squelch_adjust_t squelch_threshold)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_SQUELCH(squelch_threshold));

  LL_SYSCFG_SetUSBHSPHYSquelchThresholdAdjustment((uint32_t)squelch_threshold);
}

/**
  * @brief  Get the USB HS PHY disconnect threshold adjustment.
  * @retval hal_syscfg_squelch_adjust_t Squelch threshold adjustment value.
  */
hal_syscfg_squelch_adjust_t HAL_SYSCFG_GetUSBHSPHYSquelchThresholdAdjustment(void)
{
  return ((hal_syscfg_squelch_adjust_t)LL_SYSCFG_GetUSBHSPHYSquelchThresholdAdjustment());
}

/**
  * @brief  Set the USB HS PHY transmitter preemphasis Current control.
  * @param  src_current This parameter can be one of the following values:
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_NO
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_1
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_2
  *         @arg @ref HAL_SYSCFG_SRC_CURRENT_3
  */
void HAL_SYSCFG_SetUSBHSPHYTransmitterPreemphasisCurrent(hal_syscfg_src_current_t src_current)
{
  ASSERT_DBG_PARAM(IS_SYSCFG_USBHSPHY_SRC_CURRENT(src_current));

  LL_SYSCFG_SetUSBHSPHYTransmitterPreemphasisCurrent((uint32_t)src_current);
}

/**
  * @brief  Get the USB HS PHY transmitter preemphasis Current control.
  * @retval hal_syscfg_src_current_t Transmitter preemphasis Current control.
  */
hal_syscfg_src_current_t HAL_SYSCFG_GetUSBHSPHYTransmitterPreemphasisCurrent(void)
{
  return ((hal_syscfg_src_current_t)LL_SYSCFG_GetUSBHSPHYTransmitterPreemphasisCurrent());
}
/**
  * @}
  */
#endif /* SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE */

/**
  * @}
  */
#endif /* USE_HAL_SYSCFG_MODULE */

/**
  * @}
  */

/**
  * @}
  */
